# St7GetBeamFill

Returns the fill colour scheme for beams.

long St7GetBeamFill(long uID, long* Fill)
Input Parameters
uID
Strand7 model file ID.

Output Parameters
Fill
One of bfNone, bfProperty, bfGroup, bfColour, bfOrientation or bfContour.